L-Red/UWBIOT_SR150_LiamRoth/uwbiot-top/boards/Rhodes4_SPI/pin_mux.c
/*
* Copyright 2021-2023 NXP
* All rights reserved.
*
* SPDX-License-Identifier: BSD-3-Clause
*/
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v10.0
processor: QN9090
package_id: QN9090THN
mcu_data: ksdk2_0
processor_version: 10.0.0
pin_labels:
- {pin_num: '17', pin_signal: PIO0_14/SPI1_SSELN1/USART0_SCK/CT32B0_CAP1/PWM1/SWO/MCLK/RFTX/ADC0_0, label: SWO}
- {pin_num: '18', pin_signal: PIO0_15/SPI1_SCK/ANA_COMP_OUT/PWM3/I2C0_SCL/PDM1_DATA/RFRX/ADC0_1, label: HELIOS_GPIO5_HOST_INT, identifier: HELIOS_GPIO5_HOST_INT}
- {pin_num: '7', pin_signal: PIO0_4/SPI0_MOSI/USART0_CTS/PWM4/SPI1_SSELN1/ISO7816_IO/RFTX, label: ISP_SEL}
- {pin_num: '24', pin_signal: PIO0_20/IR_BLASTER/USART1_TXD/PWM8/RFTX/SPIFI_IO2/ACP, label: HELIOS_GPIO3_SYNC, identifier: HELIOS_GPIO3_SYNC}
- {pin_num: '8', pin_signal: PIO0_5/SPI0_SSELN/USART0_RTS/SPI1_MISO/SPI1_SSELN2/RFRX, label: ISP_ENTRY}
- {pin_num: '3', pin_signal: PIO0_0/USART0_SCK/USART1_TXD/PWM0/SPI1_SCK/PDM0_DATA, label: SCK}
- {pin_num: '4', pin_signal: PIO0_1/USART1_RXD/PWM1/SPI1_MISO/PDM0_CLK, label: SDO}
- {pin_num: '5', pin_signal: PIO0_2/SPI0_SCK/USART0_RXD/PWM2/SPI1_MOSI/ISO7816_RST/MCLK, label: SDI}
- {pin_num: '6', pin_signal: PIO0_3/SPI0_MISO/USART0_TXD/PWM3/SPI1_SSELN0/ISO7816_CLK, label: CS_N}
- {pin_num: '21', pin_signal: PIO0_17/SPI1_MOSI/ISO7816_CLK/SWO/PWM6/CLK_OUT/SPIFI_IO3/ADC0_3, label: HeliosCE, identifier: HELIOS_CE;VENUS_IRQ}
- {pin_num: '9', pin_signal: PIO0_6/SPI0_SCK/USART0_RTS/CT32B1_MAT0/PWM6/I2C1_SCL/USART1_TXD/ADE, label: VENUS_IRQ, identifier: VENUS_IRQ}
- {pin_num: '10', pin_signal: PIO0_7/SPI0_MISO/USART0_CTS/CT32B1_MAT1/PWM7/I2C1_SDA/USART1_RXD/ADO, label: VENUS_VEN, identifier: VENUS_VEN}
- {pin_num: '16', pin_signal: PIO0_13/SPI1_SSELN2/SWDIO/PWM2/I2C1_SDA/SPI0_SSELN, label: SWDIO}
- {pin_num: '15', pin_signal: PIO0_12/IR_BLASTER/SWCLK/PWM0/I2C1_SCL/SPI0_MOSI/ANA_COMP_OUT, label: SWCLK}
- {pin_num: '13', pin_signal: PIO0_10/CT32B0_CAP0/USART1_TXD/RFTX/I2C0_SCL/SPI0_SCK/PDM0_DATA, label: I2C0_SCL_SN}
- {pin_num: '14', pin_signal: PIO0_11/CT32B1_CAP0/USART1_RXD/RFRX/I2C0_SDA/SPI0_MISO/PDM0_CLK, label: I2C_SDA_SN}
- {pin_num: '11', pin_signal: PIO0_8/SPI0_MOSI/USART0_TXD/CT32B0_MAT0/PWM8/ANA_COMP_OUT/RFTX/PDM1_DATA, label: UART0_TXD}
- {pin_num: '12', pin_signal: PIO0_9/SPI0_SSELN/USART0_RXD/CT32B1_CAP1/PWM9/USART1_SCK/ADO/PDM1_CLK, label: UART0_RXD}
- {pin_num: '19', pin_signal: PIO0_16/SPI1_SSELN0/ISO7816_RST/PWM5/I2C0_SDA/PDM1_CLK/SPIFI_CSN/ADC0_2, label: SPIFI_CSN}
- {pin_num: '22', pin_signal: PIO0_18/SPI1_MISO/ISO7816_IO/CT32B0_MAT1/PWM7/USART0_TXD/SPIFI_CLK/ADC0_4, label: SPIFI_CLK}
- {pin_num: '23', pin_signal: PIO0_19/ADO/USART1_RXD/CLK_IN/PWM4/USART0_RXD/SPIFI_IO0/ADC0_5, label: SPIFI_MOSI}
- {pin_num: '25', pin_signal: PIO0_21/IR_BLASTER/USART1_SCK/PWM9/RFRX/SWO/SPIFI_IO1/ACM, label: SPIFI_MISO}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_gpio.h"
#include "fsl_inputmux.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    RV4_Init_HeliosPins();
    RV4_Init_UARTPins();
    RV4_Init_I2CPins();
    RV4_Init_SWDPins();
    RV4_Init_SPIFIPins();
#if HW_FLOW_CONTROL_SUPPORT
    RV4_Init_HW_FlowPins();
#endif
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
RV4_Init_HeliosPins:
- options: {callFromInitBoot: 'true', coreID: cm4, enableClock: 'true'}
- pin_list:
  - {pin_num: '4', peripheral: SPI1, signal: MISO, pin_signal: PIO0_1/USART1_RXD/PWM1/SPI1_MISO/PDM0_CLK, mode: pullDown}
  - {pin_num: '5', peripheral: SPI1, signal: MOSI, pin_signal: PIO0_2/SPI0_SCK/USART0_RXD/PWM2/SPI1_MOSI/ISO7816_RST/MCLK, mode: pullDown}
  - {pin_num: '3', peripheral: SPI1, signal: SCK, pin_signal: PIO0_0/USART0_SCK/USART1_TXD/PWM0/SPI1_SCK/PDM0_DATA, mode: pullDown}
  - {pin_num: '6', peripheral: SPI1, signal: SSELN0, pin_signal: PIO0_3/SPI0_MISO/USART0_TXD/PWM3/SPI1_SSELN0/ISO7816_CLK, mode: pullUp}
  - {pin_num: '24', peripheral: GPIO, signal: 'PIO0, 20', pin_signal: PIO0_20/IR_BLASTER/USART1_TXD/PWM8/RFTX/SPIFI_IO2/ACP, direction: OUTPUT, gpio_init_state: 'false',
    mode: pullDown}
  - {pin_num: '18', peripheral: GPIO, signal: 'PIO0, 15', pin_signal: PIO0_15/SPI1_SCK/ANA_COMP_OUT/PWM3/I2C0_SCL/PDM1_DATA/RFRX/ADC0_1, direction: INPUT, mode: pullDown}
  - {pin_num: '21', peripheral: GPIO, signal: 'PIO0, 17', pin_signal: PIO0_17/SPI1_MOSI/ISO7816_CLK/SWO/PWM6/CLK_OUT/SPIFI_IO3/ADC0_3, identifier: HELIOS_CE, direction: OUTPUT}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : RV4_Init_HeliosPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M4 */
void RV4_Init_HeliosPins(void)
{
    /* Enables the clock for the I/O controller block. 0: Disable. 1: Enable.: 0x01u */
    CLOCK_EnableClock(kCLOCK_Iocon);
    /* Enables the clock for the GPIO0 module */
    CLOCK_EnableClock(kCLOCK_Gpio0);

    gpio_pin_config_t HELIOS_GPIO5_HOST_INT_config = {.pinDirection = kGPIO_DigitalInput, .outputLogic = 0U};
    /* Initialize GPIO functionality on pin PIO0_15 (pin 18)  */
    GPIO_PinInit(RV4_INIT_HELIOSPINS_HELIOS_GPIO5_HOST_INT_GPIO,
        RV4_INIT_HELIOSPINS_HELIOS_GPIO5_HOST_INT_PORT,
        RV4_INIT_HELIOSPINS_HELIOS_GPIO5_HOST_INT_PIN,
        &HELIOS_GPIO5_HOST_INT_config);

