L-Red/UWBIOT_SR150_LiamRoth/uwbiot-top/boards/Rhodes4_SPI/pin_mux.c
#if 0
    /* for RV4 RevC this pin is used as interrupt for SN */
    gpio_pin_config_t HELIOS_CE_config = {.pinDirection = kGPIO_DigitalOutput, .outputLogic = 0U};
    /* Initialize GPIO functionality on pin PIO0_17 (pin 21)  */
    GPIO_PinInit(RV4_INIT_HELIOSPINS_HELIOS_CE_GPIO,
        RV4_INIT_HELIOSPINS_HELIOS_CE_PORT,
        RV4_INIT_HELIOSPINS_HELIOS_CE_PIN,
        &HELIOS_CE_config);
#endif
    gpio_pin_config_t HELIOS_GPIO3_SYNC_config = {.pinDirection = kGPIO_DigitalOutput, .outputLogic = 0U};
    /* Initialize GPIO functionality on pin PIO0_20 (pin 24)  */
    GPIO_PinInit(RV4_INIT_HELIOSPINS_HELIOS_GPIO3_SYNC_GPIO,
        RV4_INIT_HELIOSPINS_HELIOS_GPIO3_SYNC_PORT,
        RV4_INIT_HELIOSPINS_HELIOS_GPIO3_SYNC_PIN,
        &HELIOS_GPIO3_SYNC_config);

    IOCON->PIO[0][0] = ((IOCON->PIO[0][0] &
                            /* Mask bits to zero which are setting */
                            (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_MODE_MASK | IOCON_PIO_DIGIMODE_MASK)))

                        /* Select digital function assigned to this pin.
                         * : PORT00 (pin 3) is configured as SPI1_SCK. */
                        | IOCON_PIO_FUNC(PIO0_0_FUNC_ALT5)

                        /* Select function mode (on-chip pull-up/pull-down resistor control).
                         * : Pull-down.
                         * Pull-down resistor enabled. */
                        | IOCON_PIO_MODE(PIO0_0_MODE_PULL_DOWN)

                        /* Select Analog/Digital Mode.
                         * : Digital mode. */
                        | IOCON_PIO_DIGIMODE(PIO0_0_DIGIMODE_DIGITAL));

    IOCON->PIO[0][1] = ((IOCON->PIO[0][1] &
                            /* Mask bits to zero which are setting */
                            (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_MODE_MASK | IOCON_PIO_DIGIMODE_MASK)))

                        /* Select digital function assigned to this pin.
                         * : PORT01 (pin 4) is configured as SPI1_MISO. */
                        | IOCON_PIO_FUNC(PIO0_1_FUNC_ALT5)

                        /* Select function mode (on-chip pull-up/pull-down resistor control).
                         * : Pull-down.
                         * Pull-down resistor enabled. */
                        | IOCON_PIO_MODE(PIO0_1_MODE_PULL_DOWN)

                        /* Select Analog/Digital Mode.
                         * : Digital mode. */
                        | IOCON_PIO_DIGIMODE(PIO0_1_DIGIMODE_DIGITAL));

    IOCON->PIO[0][15] = ((IOCON->PIO[0][15] &
                             /* Mask bits to zero which are setting */
                             (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_MODE_MASK | IOCON_PIO_DIGIMODE_MASK |
                                 IOCON_PIO_OD_MASK))) // added OD mask

                         /* Select digital function assigned to this pin.
                          * : PORT015 (pin 18) is configured as PIO0_15. */
                         | IOCON_PIO_FUNC(PIO0_15_FUNC_ALT0)

                         /* Select function mode (on-chip pull-up/pull-down resistor control).
                          * : Pull-down.
                          * Pull-down resistor enabled. */
                         | IOCON_PIO_MODE(PIO0_15_MODE_PULL_DOWN)

                         /* Select Analog/Digital Mode.
                          * : Digital mode. */
                         | IOCON_PIO_DIGIMODE(PIO0_15_DIGIMODE_DIGITAL));

#if 0
    /* for RV4 RevC this pin is used as interrupt for SN */
    IOCON->PIO[0][17] = ((IOCON->PIO[0][17] &
                             /* Mask bits to zero which are setting */
                             (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                         /* Select digital function assigned to this pin.
                          * : PORT017 (pin 21) is configured as PIO0_17. */
                         | IOCON_PIO_FUNC(PIO0_17_FUNC_ALT0)

                         /* Select Analog/Digital Mode.
                          * : Digital mode. */
                         | IOCON_PIO_DIGIMODE(PIO0_17_DIGIMODE_DIGITAL));
#endif

    IOCON->PIO[0][2] = ((IOCON->PIO[0][2] &
                            /* Mask bits to zero which are setting */
                            (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_MODE_MASK | IOCON_PIO_DIGIMODE_MASK)))

                        /* Select digital function assigned to this pin.
                         * : PORT02 (pin 5) is configured as SPI1_MOSI. */
                        | IOCON_PIO_FUNC(PIO0_2_FUNC_ALT5)

                        /* Select function mode (on-chip pull-up/pull-down resistor control).
                         * : Pull-down.
                         * Pull-down resistor enabled. */
                        | IOCON_PIO_MODE(PIO0_2_MODE_PULL_DOWN)

                        /* Select Analog/Digital Mode.
                         * : Digital mode. */
                        | IOCON_PIO_DIGIMODE(PIO0_2_DIGIMODE_DIGITAL));

    IOCON->PIO[0][20] = ((IOCON->PIO[0][20] &
                             /* Mask bits to zero which are setting */
                             (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_MODE_MASK | IOCON_PIO_DIGIMODE_MASK)))

                         /* Select digital function assigned to this pin.
                          * : PORT020 (pin 24) is configured as PIO0_20. */
                         | IOCON_PIO_FUNC(PIO0_20_FUNC_ALT0)

                         /* Select function mode (on-chip pull-up/pull-down resistor control).
                          * : Pull-down.
                          * Pull-down resistor enabled. */
                         | IOCON_PIO_MODE(PIO0_20_MODE_PULL_DOWN)

                         /* Select Analog/Digital Mode.
                          * : Digital mode. */
                         | IOCON_PIO_DIGIMODE(PIO0_20_DIGIMODE_DIGITAL));

    IOCON->PIO[0][3] = ((IOCON->PIO[0][3] &
                            /* Mask bits to zero which are setting */
                            (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_MODE_MASK | IOCON_PIO_DIGIMODE_MASK |
                                IOCON_PIO_OD_MASK))) // added OD mask

                        /* Select digital function assigned to this pin.
                         * : PORT03 (pin 6) is configured as SPI1_SSELN0. */
                        | IOCON_PIO_FUNC(PIO0_3_FUNC_ALT5)

                        /* Select function mode (on-chip pull-up/pull-down resistor control).
                         * : Pull-up.
                         * Pull-up resistor enabled. */
                        | IOCON_PIO_MODE(PIO0_3_MODE_PULL_UP)

                        /* Select Analog/Digital Mode.
                         * : Digital mode. */
                        | IOCON_PIO_DIGIMODE(PIO0_3_DIGIMODE_DIGITAL));
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
RV4_Init_HeliosIRQPins:
- options: {callFromInitBoot: 'false', coreID: cm4, enableClock: 'true'}
- pin_list:
  - {pin_num: '18', peripheral: PINT, signal: 'PINT, 0', pin_signal: PIO0_15/SPI1_SCK/ANA_COMP_OUT/PWM3/I2C0_SCL/PDM1_DATA/RFRX/ADC0_1}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

