L-Red/UWBIOT_SR150_LiamRoth/uwbiot-top/boards/Rhodes4_SPI/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : RV4_Init_SWDPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M4 */
void RV4_Init_SWDPins(void)
{
    /* Enables the clock for the I/O controller block. 0: Disable. 1: Enable.: 0x01u */
    CLOCK_EnableClock(kCLOCK_Iocon);

    IOCON->PIO[0][12] = ((IOCON->PIO[0][12] &
                             /* Mask bits to zero which are setting */
                             (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                         /* Select digital function assigned to this pin.
                          * : PORT012 (pin 15) is configured as SWCLK. */
                         | IOCON_PIO_FUNC(PIO0_12_FUNC_ALT2)

                         /* Select Analog/Digital Mode.
                          * : Digital mode. */
                         | IOCON_PIO_DIGIMODE(PIO0_12_DIGIMODE_DIGITAL));

    IOCON->PIO[0][13] = ((IOCON->PIO[0][13] &
                             /* Mask bits to zero which are setting */
                             (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                         /* Select digital function assigned to this pin.
                          * : PORT013 (pin 16) is configured as SWDIO. */
                         | IOCON_PIO_FUNC(PIO0_13_FUNC_ALT2)

                         /* Select Analog/Digital Mode.
                          * : Digital mode. */
                         | IOCON_PIO_DIGIMODE(PIO0_13_DIGIMODE_DIGITAL));

    IOCON->PIO[0][14] = ((IOCON->PIO[0][14] &
                             /* Mask bits to zero which are setting */
                             (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_MODE_MASK | IOCON_PIO_DIGIMODE_MASK |
                                 IOCON_PIO_OD_MASK))) // added MODE, OD mask

                         /* Select digital function assigned to this pin.
                          * : PORT014 (pin 17) is configured as SWO. */
                         | IOCON_PIO_FUNC(PIO0_14_FUNC_ALT5) |
                         IOCON_PIO_MODE(0) // set mode to pull-up
                         /* Select Analog/Digital Mode.
                          * : Digital mode. */
                         | IOCON_PIO_DIGIMODE(PIO0_14_DIGIMODE_DIGITAL));
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
RV4_Init_SPIFIPins:
- options: {callFromInitBoot: 'true', coreID: cm4, enableClock: 'true'}
- pin_list:
  - {pin_num: '22', peripheral: SPIFI, signal: CLK, pin_signal: PIO0_18/SPI1_MISO/ISO7816_IO/CT32B0_MAT1/PWM7/USART0_TXD/SPIFI_CLK/ADC0_4}
  - {pin_num: '19', peripheral: SPIFI, signal: CSN, pin_signal: PIO0_16/SPI1_SSELN0/ISO7816_RST/PWM5/I2C0_SDA/PDM1_CLK/SPIFI_CSN/ADC0_2}
  - {pin_num: '23', peripheral: SPIFI, signal: SPIFI_IO0_or_SPIFI_MOSI, pin_signal: PIO0_19/ADO/USART1_RXD/CLK_IN/PWM4/USART0_RXD/SPIFI_IO0/ADC0_5}
  - {pin_num: '25', peripheral: SPIFI, signal: SPIFI_IO1_or_SPIFI_MISO, pin_signal: PIO0_21/IR_BLASTER/USART1_SCK/PWM9/RFRX/SWO/SPIFI_IO1/ACM}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : RV4_Init_SPIFIPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M4 */
void RV4_Init_SPIFIPins(void)
{
    /* Enables the clock for the I/O controller block. 0: Disable. 1: Enable.: 0x01u */
    CLOCK_EnableClock(kCLOCK_Iocon);

    IOCON->PIO[0][16] = ((IOCON->PIO[0][16] &
                             /* Mask bits to zero which are setting */
                             (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_MODE_MASK | IOCON_PIO_DIGIMODE_MASK |
                                 IOCON_PIO_OD_MASK))) // added MODE, OD mask

                         /* Select digital function assigned to this pin.
                          * : PORT016 (pin 19) is configured as SPIFI_CSN. */
                         | IOCON_PIO_FUNC(PIO0_16_FUNC_ALT7) |
                         IOCON_PIO_MODE(0) // set mode to pull-up
                         /* Select Analog/Digital Mode.
                          * : Digital mode. */
                         | IOCON_PIO_DIGIMODE(PIO0_16_DIGIMODE_DIGITAL));

    IOCON->PIO[0][18] = ((IOCON->PIO[0][18] &
                             /* Mask bits to zero which are setting */
                             (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                         /* Select digital function assigned to this pin.
                          * : PORT018 (pin 22) is configured as SPIFI_CLK. */
                         | IOCON_PIO_FUNC(PIO0_18_FUNC_ALT7)

                         /* Select Analog/Digital Mode.
                          * : Digital mode. */
                         | IOCON_PIO_DIGIMODE(PIO0_18_DIGIMODE_DIGITAL));

    IOCON->PIO[0][19] =
        ((IOCON->PIO[0][19] &
             /* Mask bits to zero which are setting */
             (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_MODE_MASK | IOCON_PIO_DIGIMODE_MASK))) // added MODE mask

            /* Select digital function assigned to this pin.
                          * : PORT019 (pin 23) is configured as SPIFI_IO0. */
            | IOCON_PIO_FUNC(PIO0_19_FUNC_ALT7) |
            IOCON_PIO_MODE(3) // set mode to pull-down
            /* Select Analog/Digital Mode.
                          * : Digital mode. */
            | IOCON_PIO_DIGIMODE(PIO0_19_DIGIMODE_DIGITAL));

    IOCON->PIO[0][21] = ((IOCON->PIO[0][21] &
                             /* Mask bits to zero which are setting */
                             (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                         /* Select digital function assigned to this pin.
                          * : PORT021 (pin 25) is configured as SPIFI_IO1. */
                         | IOCON_PIO_FUNC(PIO0_21_FUNC_ALT7)

                         /* Select Analog/Digital Mode.
                          * : Digital mode. */
                         | IOCON_PIO_DIGIMODE(PIO0_21_DIGIMODE_DIGITAL));
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
RV4_Init_ISPPins:
- options: {callFromInitBoot: 'false', coreID: cm4, enableClock: 'true'}
- pin_list: []
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

