L-Red/UWBIOT_SR150_LiamRoth/uwbiot-top/boards/Rhodes4_SPI/pin_mux.c
    gpio_pin_config_t VENUS_VEN_config = {.pinDirection = kGPIO_DigitalOutput, .outputLogic = 0U};
    /* Initialize GPIO functionality on pin PIO0_7 (pin 10)  */
    GPIO_PinInit(RV4_INIT_VENUSPINS_VENUS_VEN_GPIO,
        RV4_INIT_VENUSPINS_VENUS_VEN_PORT,
        RV4_INIT_VENUSPINS_VENUS_VEN_PIN,
        &VENUS_VEN_config);

    IOCON->PIO[0][7] = ((IOCON->PIO[0][7] &
                            /* Mask bits to zero which are setting */
                            (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                        /* Select digital function assigned to this pin.
                         * : PORT07 (pin 10) is configured as PIO0_7. */
                        | IOCON_PIO_FUNC(PIO0_7_FUNC_ALT0)

                        /* Select Analog/Digital Mode.
                         * : Digital mode. */
                        | IOCON_PIO_DIGIMODE(PIO0_7_DIGIMODE_DIGITAL));
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
RV4_Init_RevC_VenusIRQPins:
- options: {callFromInitBoot: 'false', coreID: cm4, enableClock: 'true'}
- pin_list:
  - {pin_num: '21', peripheral: GPIO, signal: 'PIO0, 17', pin_signal: PIO0_17/SPI1_MOSI/ISO7816_CLK/SWO/PWM6/CLK_OUT/SPIFI_IO3/ADC0_3, identifier: VENUS_IRQ, direction: INPUT}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : RV4_Init_RevC_VenusIRQPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M4 */
void RV4_Init_RevC_VenusIRQPins(void)
{
    CLOCK_EnableClock(kCLOCK_InputMux);
    /* Enables the clock for the I/O controller block. 0: Disable. 1: Enable.: 0x01u */
    CLOCK_EnableClock(kCLOCK_Iocon);
    /* Enables the clock for the GPIO0 module */
    INPUTMUX_AttachSignal(INPUTMUX, 1U, kINPUTMUX_GpioPort0Pin17ToPintsel);
    /* Initialize GPIO functionality on pin PIO0_17 (pin 21)  */

    IOCON->PIO[0][17] = ((IOCON->PIO[0][17] &
                             /* Mask bits to zero which are setting */
                             (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                         /* Select digital function assigned to this pin.
                          * : PORT017 (pin 21) is configured as PIO0_17. */
                         | IOCON_PIO_FUNC(PIO0_17_FUNC_ALT0)

                         /* Select Analog/Digital Mode.
                          * : Digital mode. */
                         | IOCON_PIO_DIGIMODE(PIO0_17_DIGIMODE_DIGITAL));
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
RV4_Init_RevB_VenusIRQPins:
- options: {callFromInitBoot: 'false', coreID: cm4, enableClock: 'true'}
- pin_list:
  - {pin_num: '9', peripheral: PINT, signal: 'PINT, 1', pin_signal: PIO0_6/SPI0_SCK/USART0_RTS/CT32B1_MAT0/PWM6/I2C1_SCL/USART1_TXD/ADE}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : RV4_Init_RevB_VenusIRQPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M4 */
void RV4_Init_RevB_VenusIRQPins(void)
{
    /* Enables the clock for the Input Mux. 0: Disable. 1: Enable.: 0x01u */
    CLOCK_EnableClock(kCLOCK_InputMux);
    /* Enables the clock for the I/O controller block. 0: Disable. 1: Enable.: 0x01u */
    CLOCK_EnableClock(kCLOCK_Iocon);
    /* PIO0_6 is selected for PINT input 1 */
    INPUTMUX_AttachSignal(INPUTMUX, 1U, kINPUTMUX_GpioPort0Pin6ToPintsel);

    IOCON->PIO[0][6] = ((IOCON->PIO[0][6] &
                            /* Mask bits to zero which are setting */
                            (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_MODE_MASK | IOCON_PIO_DIGIMODE_MASK |
                                IOCON_PIO_OD_MASK))) // added MODE, OD mask

                        /* Select digital function assigned to this pin.
                         * : PORT06 (pin 9) is configured as PIO0_6. */
                        | IOCON_PIO_FUNC(PIO0_6_FUNC_ALT0) |
                        IOCON_PIO_MODE(3) // set mode to pull-down
                        /* Select Analog/Digital Mode.
                         * : Digital mode. */
                        | IOCON_PIO_DIGIMODE(PIO0_6_DIGIMODE_DIGITAL));
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/